{
    "More": [
        {
            "Thumbnail": "Images/review1_other.jpg",
            "Title": "Predator Helios 300 Review",
            "Date": [
                "Images/Icons/cal.png",
                "Sep 15, 2022777777"
            ],
            "Type": [
                "Images/Icons/tech.png",
                "Tech"
            ]
        },
        {
            "Thumbnail": "Images/review2_other.jpg",
            "Title": "Salt & Sacrifice Review",
            "Date": [
                "Images/Icons/cal.png",
                "Sep 15, 2022"
            ],
            "Type": [
                "Images/Icons/game.png",
                "Games"
            ]
        },
        {
            "Thumbnail": "Images/review3_other.jpg",
            "Title": "Pixel 6A Review",
            "Date": [
                "Images/Icons/cal.png",
                "Sep 15, 2022"
            ],
            "Type": [
                "Images/Icons/tech.png",
                "Tech"
            ]
        },
        {
            "Thumbnail": "Images/review4_other.jpg",
            "Title": "Postal4: No Regrets Review",
            "Date": [
                "Images/Icons/cal.png",
                "Sep 15, 2022"
            ],
            "Type": [
                "Images/Icons/game.png",
                "Games"
            ]
        }
    ],
    "Content": [
        {
            "Text": "NBA 2K23 is like watching your favorite team clank a wide-open dunk to lose the game. They’d been playing well the whole time, with on-court gameplay that’s better than ever, plus various retro modes that are amazing for basketball history nerds like myself, and there is a litany of modes meant to hold your interest over for dozens, if not hundreds, of hours. So where does it all go wrong? The NBA 2K franchise has put such an emphasis on pay-to-win microtransactions that its most popular game mode, the online MyCareer, feels horribly discouraging from the outset due to the disadvantage you’ll face unless you’re willing to throw down extra cash. So even while NBA 2K23 emulates the game of basketball so well, both in its present form and illustrious past of the NBA – it’s just more difficult than ever to ignore the emphasis on sucking cash out of our wallets."
        },
        {
            "Text": "There was a shocking moment of realization for me a few hours into my MyCareer experience: the allotment of virtual currency (VC) I’d earned during that time was enough to buy my character a new pair of pants. Not a particularly special pair of pants, mind you, but a pair of Under Armour black sweats that look similar to the ones I wear when I go shoot hoops. Not a terribly impressive reward, and I was already feeling poor after spending the majority of the 100,000 VC that came with the $100 Michael Jordan Edition of NBA 2K23 just to get my player’s attributes up to a level that felt competitive for some court action in The City, NBA 2K23’s impressively large hub for all things MyCareer."
        },
        {
            "Text": "Unfortunately, even my generous head start on VC wasn’t enough to compete with the real big spenders out there, and I’ve already run into more of them than I expected. Half of the players I encountered in The City were already well above my player’s ratings — likely because they decided to shell out extra cash for an attribute buff. For example, even as a rebound-focused center, I was regularly getting out jumped and rebounded by much smaller players. I found the scores to frequently be weighted in favor of teams with high player attribute ratings, and whether that’s largely in my head or not, it’s definitely making games feel unenjoyable and imbalanced."
        },
        {
            "Text": "And yes, with enough grinding I could theoretically reach the same heights as those players who paid their way to glory on release day – but I’ve found that to be a purposefully arduous process. Even playing through the MyCareer story mode, which features the story of MP, a character forced to earn the favor of the fanbase that drafted him, I found myself short stocked on VC. My remaining options (including daily login rewards and quests in The City) were unappealing, and I dreaded the idea of going back into The City for more beatdowns from higher-rated players to earn a pittance for every loss."
        },
        {
            "Text": "This is made all the more frustrating by the fact that, underneath all of the microtransactions, there is a genuinely good game that would be a lot of fun if I had faith that the playing field would be level. The City is dense and fun to explore, even with the difficult-to-control vehicle options like riding around on a skateboard. Seeing other players in an environment that is just dripping with basketball everywhere you look is a really amazing experience. Shopping around can be a lot of fun, too – it’s just aggravating that the items, such as apparel and mobility options like the skateboard or scooter, often require a chunk of the same VC that I need for leveling up my player. Even the courts are visually distinct, with my favorite being embedded in a volcanic mountainside."
        },
        {
            "Text": "Fortunately, NBA 2K23 has plenty of other game modes to spend time in, including a couple that I’m in love with. First and foremost, the Jordan Challenge serves as an interactive timeline through Michael Jordan’s historic basketball career, starting with his 1982 NCAA Championship with the University of North Carolina and ending with his last championship-winning game against the Jazz in 1998. Accompanying each moment are a set of three challenges, often designed to replicate Jordan’s performance in each of the specific moments. For instance, one challenge in the NCAA Championship game is to score 16 points, and another is to grab nine rebounds with Jordan himself. Each of these moments is a real spectacle, and is accompanied by retro-style graphics and filters. Even though I wasn’t around for many of Jordan’s biggest moments, I’ve re-lived them through documentaries like ESPN’s “The Last Dance” and re-broadcasts, and that’s enough for the intense nostalgia that comes with being able to replicate these moments in game to wash over me. It’s the most fun I had with NBA 2K23 by a landslide."
        },
        {
            "Text": "In a similar vein, MyNBA (NBA 2K23’s franchise mode) now offers several “eras” to play in, including the Magic and Bird era, the Jordan era, the Kobe era, and of course, the modern era. As an NBA history buff, being able to dive into the NBA’s various golden ages is an absolute blast. My love of sports developed during the early 2000s, so being able to rewind the clock and run the court with a dominant Kobe Bryant and Shaquille O’Neal is something I never knew I needed so badly."
        },
        {
            "Text": "Not only do the era modes replicate most of the rosters of their day (for instance, squaring off against obscure players like Carlos Boozer, who I had all but forgotten about, was really entertaining), you also get to scout players who were in subsequent NBA Drafts. And if you’re into NBA history, you’ll note that 2003 was the year future stars like Lebron James, Carmelo Anthony, Dwayne Wade, and Chris Bosh were drafted, so it is what you could call a target-rich environment. On top of all of that, the graphics and retro filters meticulously encapsulate the presentation of these bygone eras – though thankfully, there are options to turn them off if you’d rather play with the standard, gorgeous NBA 2K23 look and feel."
        },
        {
            "Text": "On that topic, most of the changes to that look and feel were reserved for the various era modes. That being said, there is a really strong emphasis on capturing the atmosphere of prior golden ages of the NBA. For instance, I got a kick out of Kevin Harlan talking about the differences in the NBA and NCAA back in 1982, where there was no three-point line in college basketball. Outside of the retro-era makeover, there isn’t a lot of new – but that’s forgivable, given that the NBA 2K series already delivers the best graphics in sports gaming "
        },
        {
            "Text": "I am heavily conflicted about NBA 2K23. On one hand, the new retro game modes have reached out to my inner sports geek and given me a way to replay NBA history in a way that I’ve never done before. Especially paired with a handful of really strong gameplay changes, like improved spacing and AI, I foresee myself dumping dozens of hours into reliving and reconstructing NBA history. Conversely, I now feel completely and utterly isolated from the MyCareer experience. I have no interest in shelling out additional cash (even beyond the expensive Michael Jordan Edition) or grind for insane hours just to be able to compete on the online court, and the density of The City and its shopping opportunities is lost on me for the same reason. Instead, I’ll take my metaphorical basketball and go home, where I can enjoy the parts of NBA 2K23 that I can fully experience without the repugnant emphasis of its microtransactions."
        }
    ],
    "Quote": [
        {
            "Text": "\" Microtransactions are making games feel unenjoyable and imbalanced. \""
        },
        {
            "Text": "\" The Jordan Challenge is the most fun I had with NBA 2K23 by a landslide. \""
        },
        {
            "Text": "\" Runing the court with a dominant Kobe Bryant and Shaquille O’Neal is something I never knew I needed so badly. \""
        },
        {
            "Text": "\" NBA 2K23 is as close as the series has ever come to emulating a real game of basketball. \""
        }
    ]
}